actions = [
    # Уравнения / корни
    "solve", "nsolve",

    # Алгебра / упрощение
    "simplify", "factor", "expand", "collect", "cancel", "together", "apart",

    # Дифференцирование / интегрирование
    "diff", "integrate",

    # Подстановка / численные преобразования / lambdify
    "subs", "evalf", "N", "lambdify",

    # Матрицы - базовые
    "Matrix", "eye", "zeros", "ones", "diag",
    "matrix_inverse", "matrix_det", "matrix_rank", "eigenvals", "eigenvects",

    # Визуализация / вывод
    "plot", "plot3d", "latex", "pretty", "python",

    "solveset",
    # Доп. упрощения / работа с выражениями
    "radsimp", "powsimp", "logcombine", "nsimplify", "factor_terms",

    # Полиномы / корни / дискриминант
    "Poly", "degree", "factor_list", "discriminant", "nroots",

    # Дифференциальные операторы / интегралы
    "derivative", "gradient", "laplacian", "Integral",

    # Пределы / ряды
    "limit", "series", "removeO",

    # Комбинаторика / числа
    "factorial", "binomial", "permutations", "combinations",

    # Логика / множества (базовые)
    "And", "Or", "Not", "FiniteSet", "Interval"
]

actions_ru = [
    # Уравнения / корни
    "решить", "нрешить", "решение", "корни",

    # Алгебра / упрощение
    "упростить", "разложить", "раскрыть", "собрать", "сократить", "объединить", "разделить",

    # Дифференцирование / интегрирование
    "производная", "дифференцировать", "интеграл", "интегрировать",

    # Подстановка / численные преобразования
    "подставить", "вычислить", "численно",

    # Матрицы - базовые
    "матрица", "единичная", "нулевая", "диагональ",
    "обратная", "определитель", "ранг", "собственные", "собзначения", "собвекторы",

    # Визуализация / вывод
    "график", "график3д", "латекс", "красиво",

    # Доп. упрощения
    "упрощениерад", "упрощениестеп", "объединитьлог", "рационализовать",

    # Полиномы / корни / дискриминант
    "полином", "степень", "разложениеспис", "дискриминант", "численныекорни",

    # Дифференциальные операторы / интегралы
    "градиент", "лапласиан",

    # Пределы / ряды
    "предел", "ряд", "удалитьо",

    # Комбинаторика / числа
    "факториал", "биномиал", "перестановки", "сочетания",

    # Логика / множества
    "и", "или", "не", "множество", "интервал"
]