{
  "token2id": {
    "[PAD]": 0,
    "[SOS]": 1,
    "[EOS]": 2,
    "[UNK]": 3,
    "(": 4,
    ")": 5,
    "-": 6,
    ",": 7,
    "**": 8,
    "2": 9,
    "+": 10,
    "*": 11,
    "3": 12,
    "sin": 13,
    "1": 14,
    "[": 15,
    "]": 16,
    "/": 17,
    "4": 18,
    "s": 19,
    "k": 20,
    "cos": 21,
    "of": 22,
    "5": 23,
    "exp": 24,
    "b": 25,
    "n": 26,
    "x": 27,
    "a": 28,
    "c": 29,
    "z": 30,
    "m": 31,
    "u": 32,
    "t": 33,
    "y": 34,
    "r": 35,
    "v": 36,
    "10": 37,
    "6": 38,
    "9": 39,
    "8": 40,
    "7": 41,
    "log": 42,
    "tan": 43,
    "0": 44,
    "30": 45,
    "15": 46,
    "100": 47,
    "25": 48,
    "20": 49,
    "50": 50,
    "sqrt": 51,
    "Matrix": 52,
    "solve": 53,
    "expand": 54,
    "в": 55,
    "разложи": 56,
    "collect": 57,
    "binomial": 58,
    "degree": 59,
    "discriminant": 60,
    "lcm": 61,
    "cancel": 62,
    "gcd": 63,
    "factorial": 64,
    "=": 65,
    "series": 66,
    "fibonacci": 67,
    "limit": 68,
    "на": 69,
    "ln": 70,
    "simplify": 71,
    "factor": 72,
    "integrate": 73,
    "раскрой": 74,
    "expand_trig": 75,
    "isprime": 76,
    "factorint": 77,
    "dsolve": 78,
    "число": 79,
    "evalf": 80,
    "together": 81,
    "subs": 82,
    "Interval": 83,
    "реши": 84,
    "transform": 85,
    "diff": 86,
    "fourier_transform": 87,
    "fractions": 88,
    "простые": 89,
    "eigenvals": 90,
    "det": 91,
    "C": 92,
    "apart": 93,
    "and": 94,
    "inv": 95,
    "laplace_transform": 96,
    "FiniteSet": 97,
    "преобразование": 98,
    "и": 99,
    "уравнение": 100,
    "prime": 101,
    "от": 102,
    "до": 103,
    "при": 104,
    "к": 105,
    "множители": 106,
    "логарифм": 107,
    "from": 108,
    "to": 109,
    "сократи": 110,
    "корень": 111,
    "простое": 112,
    "факториал": 113,
    "equation": 114,
    "фибоначчи": 115,
    "ряд": 116,
    "oo": 117,
    "по": 118,
    "производная": 119,
    "тригонометрию": 120,
    "interval": 121,
    "предел": 122,
    "laplace": 123,
    "фурье": 124,
    "by": 125,
    "тангенс": 126,
    "eigenvalues": 127,
    "дискриминант": 128,
    "определитель": 129,
    "матрицы": 130,
    "inverse": 131,
    "matrix": 132,
    "дифференциальное": 133,
    "приведи": 134,
    "общему": 135,
    "знаменателю": 136,
    "factorization": 137,
    "подставь": 138,
    "differential": 139,
    "coefficient": 140,
    "substitute": 141,
    "in": 142,
    "combine": 143,
    "собери": 144,
    "интеграл": 145,
    "partial": 146,
    "степень": 147,
    "многочлена": 148,
    "множество": 149,
    "trig": 150,
    "дроби": 151,
    "синус": 152,
    "биномиальный": 153,
    "коэффициент": 154,
    "fourier": 155,
    "интервал": 156,
    "косинус": 157,
    "нок": 158,
    "set": 159,
    "собственные": 160,
    "значения": 161,
    "дробь": 162,
    "детерминант": 163,
    "нод": 164,
    "обратная": 165,
    "матрица": 166,
    "лапласа": 167,
    "квадратный": 168,
    "evaluate": 169,
    "numerically": 170,
    "exponential": 171,
    "square": 172,
    "root": 173,
    "натуральный": 174,
    "taylor": 175,
    "е": 176,
    "вычисли": 177,
    "численно": 178,
    "is": 179,
    "ли": 180,
    "тейлора": 181,
    "Eq": 182,
    "численное": 183,
    "значение": 184,
    "logarithm": 185,
    "из": 186,
    "около": 187,
    "number": 188,
    "e": 189,
    "степени": 190,
    "экспонента": 191,
    "факторизуй": 192,
    "as": 193,
    "approaches": 194,
    "стремится": 195,
    "скобки": 196,
    "lim": 197,
    "open": 198,
    "brackets": 199,
    "factorize": 200,
    "упростить": 201,
    "reduce": 202,
    "упрости": 203,
    "проинтегрируй": 204,
    "find": 205,
    "roots": 206,
    "integral": 207,
    "определ": 208,
    "нный": 209,
    "я": 210,
    "дифференцируй": 211,
    "порядка": 212,
    "differentiate": 213,
    "derivative": 214
  },
  "id2token": {
    "0": "[PAD]",
    "1": "[SOS]",
    "2": "[EOS]",
    "3": "[UNK]",
    "4": "(",
    "5": ")",
    "6": "-",
    "7": ",",
    "8": "**",
    "9": "2",
    "10": "+",
    "11": "*",
    "12": "3",
    "13": "sin",
    "14": "1",
    "15": "[",
    "16": "]",
    "17": "/",
    "18": "4",
    "19": "s",
    "20": "k",
    "21": "cos",
    "22": "of",
    "23": "5",
    "24": "exp",
    "25": "b",
    "26": "n",
    "27": "x",
    "28": "a",
    "29": "c",
    "30": "z",
    "31": "m",
    "32": "u",
    "33": "t",
    "34": "y",
    "35": "r",
    "36": "v",
    "37": "10",
    "38": "6",
    "39": "9",
    "40": "8",
    "41": "7",
    "42": "log",
    "43": "tan",
    "44": "0",
    "45": "30",
    "46": "15",
    "47": "100",
    "48": "25",
    "49": "20",
    "50": "50",
    "51": "sqrt",
    "52": "Matrix",
    "53": "solve",
    "54": "expand",
    "55": "в",
    "56": "разложи",
    "57": "collect",
    "58": "binomial",
    "59": "degree",
    "60": "discriminant",
    "61": "lcm",
    "62": "cancel",
    "63": "gcd",
    "64": "factorial",
    "65": "=",
    "66": "series",
    "67": "fibonacci",
    "68": "limit",
    "69": "на",
    "70": "ln",
    "71": "simplify",
    "72": "factor",
    "73": "integrate",
    "74": "раскрой",
    "75": "expand_trig",
    "76": "isprime",
    "77": "factorint",
    "78": "dsolve",
    "79": "число",
    "80": "evalf",
    "81": "together",
    "82": "subs",
    "83": "Interval",
    "84": "реши",
    "85": "transform",
    "86": "diff",
    "87": "fourier_transform",
    "88": "fractions",
    "89": "простые",
    "90": "eigenvals",
    "91": "det",
    "92": "C",
    "93": "apart",
    "94": "and",
    "95": "inv",
    "96": "laplace_transform",
    "97": "FiniteSet",
    "98": "преобразование",
    "99": "и",
    "100": "уравнение",
    "101": "prime",
    "102": "от",
    "103": "до",
    "104": "при",
    "105": "к",
    "106": "множители",
    "107": "логарифм",
    "108": "from",
    "109": "to",
    "110": "сократи",
    "111": "корень",
    "112": "простое",
    "113": "факториал",
    "114": "equation",
    "115": "фибоначчи",
    "116": "ряд",
    "117": "oo",
    "118": "по",
    "119": "производная",
    "120": "тригонометрию",
    "121": "interval",
    "122": "предел",
    "123": "laplace",
    "124": "фурье",
    "125": "by",
    "126": "тангенс",
    "127": "eigenvalues",
    "128": "дискриминант",
    "129": "определитель",
    "130": "матрицы",
    "131": "inverse",
    "132": "matrix",
    "133": "дифференциальное",
    "134": "приведи",
    "135": "общему",
    "136": "знаменателю",
    "137": "factorization",
    "138": "подставь",
    "139": "differential",
    "140": "coefficient",
    "141": "substitute",
    "142": "in",
    "143": "combine",
    "144": "собери",
    "145": "интеграл",
    "146": "partial",
    "147": "степень",
    "148": "многочлена",
    "149": "множество",
    "150": "trig",
    "151": "дроби",
    "152": "синус",
    "153": "биномиальный",
    "154": "коэффициент",
    "155": "fourier",
    "156": "интервал",
    "157": "косинус",
    "158": "нок",
    "159": "set",
    "160": "собственные",
    "161": "значения",
    "162": "дробь",
    "163": "детерминант",
    "164": "нод",
    "165": "обратная",
    "166": "матрица",
    "167": "лапласа",
    "168": "квадратный",
    "169": "evaluate",
    "170": "numerically",
    "171": "exponential",
    "172": "square",
    "173": "root",
    "174": "натуральный",
    "175": "taylor",
    "176": "е",
    "177": "вычисли",
    "178": "численно",
    "179": "is",
    "180": "ли",
    "181": "тейлора",
    "182": "Eq",
    "183": "численное",
    "184": "значение",
    "185": "logarithm",
    "186": "из",
    "187": "около",
    "188": "number",
    "189": "e",
    "190": "степени",
    "191": "экспонента",
    "192": "факторизуй",
    "193": "as",
    "194": "approaches",
    "195": "стремится",
    "196": "скобки",
    "197": "lim",
    "198": "open",
    "199": "brackets",
    "200": "factorize",
    "201": "упростить",
    "202": "reduce",
    "203": "упрости",
    "204": "проинтегрируй",
    "205": "find",
    "206": "roots",
    "207": "integral",
    "208": "определ",
    "209": "нный",
    "210": "я",
    "211": "дифференцируй",
    "212": "порядка",
    "213": "differentiate",
    "214": "derivative"
  }
}